soap_publish_message_fhir.xml

<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:a="http://www.w3.org/2005/08/addressing"
  xmlns:oh="urn:openhie.org:alerting"
  >
  <s:Header>
    <oh:IntendedRecipient>
      <oh:QueryTarget type="urn:ihe:iti:csd:2014:stored-function:facility-search">
        <csd:requestParams>
          <csd:codedType code="OPC" codingSchema="XXXXXX" />
          <csd:address>
            <csd:addressLine component="city">Chapel Hill</csd:addressLine>
          </csd:address>
        </csd:requestParams>
      </oh:QueryTarget>
      <oh:Target id='urn:ecid:1234'/>
    </oh:IntendedRecipient>
  </s:Header>
  <s:Body>
    <oh:Message
	id='80b60040-4729-11e4-916c-0800200c9a66'
	published='2010-11-12T13:14:15Z'
	content-type='text/xml+fhir; charset=utf-8'  
	xml:lang='en_US'>
      <Alert xmlns="http://hl7.org/fhir">
	<text>
          <status value="generated"/>
          <div xmlns="http://www.w3.org/1999/xhtml">Lot #2039 of medication X was recalled, you may have administered this to one or more of your patients, please look for X, Y</div>
	</text>
	<extension url="http[s]://alert-manager/Profile/ohie-alert#alertCode">
          <valueCodeableConcept>
            <coding>
              <system value="uri to alert codes"/>
              <code value="40596856"/>
              <primary value="true"/>
            </coding>
            <text value="Medication Recall"/>
          </valueCodeableConcept>
	</extension>
	<contained>
          <Device ID="AuthorOrganization">
            <identifier>
              <use value="usual"/>
              <system value="urn:oid:LOCAL ORG OID"/>
              <value value="LOCAL IDENTIFIER"/>
            </identifier>
            <name value="Local Drug Administration"/>
            <telecom>
              <system value="phone"/>
              <value value="tel:+180038403948"/>
            </telecom>
          </Device>
	</contained>
	<category>
          <coding>
            <system value="url to alert types"/>
            <code value="recall"/>
            <display value="Recall"/>
          </coding>
	</category>
	<status value="active"/>
	<author>
          <reference value="#AuthorOrganization"/>
          <display value="Local Drug Administration"/>
	</author>
	<note value="Missed last ANC visit"/>
      </Alert>
    </oh:Message>    
  </s:Body>

</s:Envelope>
